
#Задание 1
language = ["китайский","испанский","английский","хинди","арабский","бенгальский", "португальский", "русский"]
print(language)
language9 =language +["японский"]
print(language9)
print(language9[3:6])

#Задание 2

dict= {"первое слово":"ампер","второе слово":"фаза","третье слово":"нейтраль","четвертое слово":"земля","пятое слово":"ноль","шестое слово":"активная мощность","седьмое слово":"реактивная мощность","восьмое слово":"транзистор","девятое слово":"подстанция","10 слово":"трансформатор"}
dict["одиннадцатое слово"] = "Амплитуды"
print(dict)
print(dict.keys())

#Задание 3

a = int(input("Введите первое число:"))
b=int(input("Введите второе число:"))
c=int(input("Введите третье число:"))

list1 = [a,b,c]
list1.sort()

print(list1)